import random

messages = {
    'entry': [
        "",
        "いくよー",
        "むむっ",
        "とうっっ",
        "はー！"
    ],
    'take_profit': [
        "",
        "わーい",
        "やたー",
        "いぇい",
        "ほほう",
        "ふふふ"
    ],
    'losscut': [
        "",
        "むーん",
        "ぽよー",
        "にゃー",
        "きゃー",
        "はわー"
    ]
}

kaomojis = {
    'positive': [
        "(。·ω·。)",
        "(。◕ ∀ ◕｡)",
        "₍₍ ( ๑॔˃̶◡ ˂̶๑॓)◞♡",
        "（*'∀'人）♥*+",
        "(*•̀ᴗ•́*)و ̑̑",
        "(*´╰╯`๓)♬",
        "(*´ω｀*)",
        "(*∩ω∩)",
        "(＊◕ᴗ◕＊)",
        "(≧▽≦)",
        "(≧ω≦)",
        "(⋈◍＞◡＜◍)。✧♡",
        "(▰╹◡╹▰)",
        "（◔ω◔ * ）",
        "(✖╹◡╹✖)◞",
        "(✿´꒳`)ﾉ°+.*",
        "(๑ ́ᄇ`๑)",
        "(๑ˇεˇ๑)•*¨*•.¸¸♪",
        "(๑ゝω╹๑)",
        "(๑ơ ₃ ơ)♥",
        "(o^∀^o)",
        "(っ*´∀｀*)っ",
        "*ଘ(੭*◕ฺω◕ฺ)੭*ੈ",
        "＼＼\(۶•̀ᴗ•́)۶//／／",
        "❤(。☌ᴗ☌｡)",
        "꒰◍ᐡᐤᐡ◍꒱",
        "꒰๑•௰•๑꒱",
        "ヽ(。·ω·。)ﾉ",
        "٩( ๑╹ ꇴ╹)۶",
        "٩꒰｡•◡•。꒱۶'",
        "ଘ(੭ˊ꒳​ˋ)੭✧",
        "ฅ(♡ơ ₃ơ)ฅ"
    ],
    'negative': [
        "('﹏*๑)",
        "(。ì _ í。)",
        "_(┐「ε:)_",
        "(´-ω-`)",
        "（´◕ д ◕｀）",
        "(๑•́ ₃ •̀๑)",
        "( ᵒ̴̶̷̥́ _ᵒ̴̶̷̣̥̀ )",
        "(๑ó⌓ò๑)",
        "(ﾉ*'ω'*)ﾉ彡┻━┻",
        "‧⁺◟( ᵒ̴̶̷̥́ ·̫ ᵒ̴̶̷̣̥̀ )",
        "ฅ(๑*д*๑)ฅ!!"
    ],
    'neutral': [
        "φ(ﾟ-ﾟ=)",
        "(๑•﹏•)",
        "(*·～·*)",
        "( ๑´•ω•)۶”",
        "(∂ω∂)",
        "(´ฅω•ฅ｀)",
        "(๑·㉨·๑)",
        "─=≡Σ((( つ•̀ω•́)つ",
        "(^·ｪ·^)",
        "⊂( *·ω· )⊃",
        "c(·ω·`c⌒っ",
        "·*·:≡( ε:)"
    ]
}

def get_kaomoji(feeling):
    return random.choice(kaomojis[feeling])

def get_message(action):
    return random.choice(messages[action])
